<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"89907b7395886b4f2891f40b827cff0645c8c3648572dd7f1d7d717d3605bda0","plan_job_ref":"Job Environment Main - Plan #393 at https://github.com/jarrod-lowe/wildsea/actions/runs/11310284170","plan_out_hash":"accac680b9fe0b726c51de477b30d1c5f97b542155b50a3650cf98f86e8482a0","plan_hash":"90b0342ac3c5eabe42e1dde43339d4c0d4c6f2cc0d8758db1570ef1ceb8f6047","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_function.function["deleteSection"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/deleteSection/deleteSection.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeShip = "SHIP";
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            
            // function/deleteSection/deleteSection.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              return {
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + input.sectionId
                }),
                operation: "DeleteItem",
                condition: {
                  expression: "#userId = :userId OR #playerType = :playerType",
                  expressionNames: {
                    "#userId": "userId",
                    "#playerType": "playerType"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":userId": identity.sub,
                    ":playerType": TypeShip
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                if (context.error.type === "DynamoDB:ConditionalCheckFailedException")
                  util.unauthorized();
                util.error(context.error.message, context.error.type, context.result);
              }
              return { ...context.result, deleted: true };
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZGVsZXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0kvQyxJQUFNLFdBQVc7QUFFakIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxtQkFBbUI7OztBREZ6QixTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFFaEMsU0FBTztBQUFBLElBQ0wsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksbUJBQW1CLE1BQU0sTUFBTTtBQUFBLElBQ3JDLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxJQUNYLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsZUFBZTtBQUFBLE1BQ2pCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxXQUFXLFNBQVM7QUFBQSxRQUNwQixlQUFlO0FBQUEsTUFDakIsQ0FBQztBQUFBLElBQ0g7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBdUM7QUFDOUQsTUFBSSxRQUFRLE9BQU87QUFDakIsUUFBSSxRQUFRLE1BQU0sU0FBUztBQUN6QixXQUFLLGFBQWE7QUFDcEIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBR0EsU0FBTyxFQUFFLEdBQUcsUUFBUSxRQUFRLFNBQVMsS0FBSztBQUM1QzsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "deleteSection"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["updateSection"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/updateSection/updateSection.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeShip = "SHIP";
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            
            // function/updateSection/updateSection.ts
            function request(context) {
          -   if (!context.identity) {
          -     util.error("Unauthorized: Identity information is missing.");
          -   }
          +   if (!context.identity) util.unauthorized();
              const identity = context.identity;
          -   if (!identity?.sub) {
          -     util.error("Unauthorized: User ID is missing.");
          -   }
          +   if (!identity?.sub) util.unauthorized();
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              const sk = DDBPrefixSection + "#" + input.sectionId;
              const updates = {
                updatedAt: timestamp
              };
              if (input.sectionName !== void 0) {
                updates.sectionName = input.sectionName;
              }
              if (input.content !== void 0) {
                updates.content = input.content;
              }
              if (input.position !== void 0) {
                updates.position = input.position;
              }
              const setExpressions = [];
              const expressionAttributeNames = {};
              const expressionAttributeValues = {};
              Object.entries(updates).forEach(([key, value]) => {
                const placeholderKey = `#${key}`;
                const placeholderValue = `:${key}`;
                setExpressions.push(`${placeholderKey} = ${placeholderValue}`);
                expressionAttributeNames[placeholderKey] = key;
                expressionAttributeValues[placeholderValue] = value;
              });
              const setExpressionString = `SET ${setExpressions.join(", ")}`;
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: sk
                }),
                condition: {
                  expression: "#userId = :userId OR #playerType = :playerType",
                  expressionNames: {
                    "#userId": "userId",
                    "#playerType": "playerType"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":userId": identity.sub,
                    ":playerType": TypeShip
                  })
                },
                update: {
                  expression: setExpressionString,
                  expressionNames: expressionAttributeNames,
                  expressionValues: util.dynamodb.toMapValues(expressionAttributeValues)
                }
              };
            }
            function response(context) {
              if (context.error) {
                if (context.error.type === "DynamoDB:ConditionalCheckFailedException")
                  util.unauthorized();
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0kvQyxJQUFNLFdBQVc7QUFFakIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxtQkFBbUI7OztBREt6QixTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxLQUFLO0FBQ2xCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBQ3ZDLFFBQU0sS0FBSyxtQkFBbUIsTUFBTSxNQUFNO0FBRTFDLFFBQU0sVUFBc0I7QUFBQSxJQUMxQixXQUFXO0FBQUEsRUFDYjtBQUNBLE1BQUksTUFBTSxnQkFBZ0IsUUFBVztBQUNuQyxZQUFRLGNBQWMsTUFBTTtBQUFBLEVBQzlCO0FBQ0EsTUFBSSxNQUFNLFlBQVksUUFBVztBQUMvQixZQUFRLFVBQVUsTUFBTTtBQUFBLEVBQzFCO0FBQ0EsTUFBSSxNQUFNLGFBQWEsUUFBVztBQUNoQyxZQUFRLFdBQVcsTUFBTTtBQUFBLEVBQzNCO0FBRUEsUUFBTSxpQkFBMkIsQ0FBQztBQUNsQyxRQUFNLDJCQUFzRCxDQUFDO0FBQzdELFFBQU0sNEJBQWdFLENBQUM7QUFFdkUsU0FBTyxRQUFRLE9BQU8sRUFBRSxRQUFRLENBQUMsQ0FBQyxLQUFLLEtBQUssTUFBTTtBQUNoRCxVQUFNLGlCQUFpQixJQUFJLEdBQUc7QUFDOUIsVUFBTSxtQkFBbUIsSUFBSSxHQUFHO0FBRWhDLG1CQUFlLEtBQUssR0FBRyxjQUFjLE1BQU0sZ0JBQWdCLEVBQUU7QUFDN0QsNkJBQXlCLGNBQWMsSUFBSTtBQUMzQyw4QkFBMEIsZ0JBQWdCLElBQUk7QUFBQSxFQUNoRCxDQUFDO0FBQ0QsUUFBTSxzQkFBc0IsT0FBTyxlQUFlLEtBQUssSUFBSSxDQUFDO0FBRTVELFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJO0FBQUEsSUFDTixDQUFDO0FBQUEsSUFDRCxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxRQUNYLGVBQWU7QUFBQSxNQUNqQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsV0FBVyxTQUFTO0FBQUEsUUFDcEIsZUFBZTtBQUFBLE1BQ2pCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxNQUNqQixrQkFBa0IsS0FBSyxTQUFTLFlBQVkseUJBQXlCO0FBQUEsSUFDdkU7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBdUM7QUFDOUQsTUFBSSxRQUFRLE9BQU87QUFDakIsUUFBSSxRQUFRLE1BQU0sU0FBUztBQUN6QixXQUFLLGFBQWE7QUFDcEIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBQ0EsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0kvQyxJQUFNLFdBQVc7QUFFakIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxtQkFBbUI7OztBREt6QixTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFDdkMsUUFBTSxLQUFLLG1CQUFtQixNQUFNLE1BQU07QUFFMUMsUUFBTSxVQUFzQjtBQUFBLElBQzFCLFdBQVc7QUFBQSxFQUNiO0FBQ0EsTUFBSSxNQUFNLGdCQUFnQixRQUFXO0FBQ25DLFlBQVEsY0FBYyxNQUFNO0FBQUEsRUFDOUI7QUFDQSxNQUFJLE1BQU0sWUFBWSxRQUFXO0FBQy9CLFlBQVEsVUFBVSxNQUFNO0FBQUEsRUFDMUI7QUFDQSxNQUFJLE1BQU0sYUFBYSxRQUFXO0FBQ2hDLFlBQVEsV0FBVyxNQUFNO0FBQUEsRUFDM0I7QUFFQSxRQUFNLGlCQUEyQixDQUFDO0FBQ2xDLFFBQU0sMkJBQXNELENBQUM7QUFDN0QsUUFBTSw0QkFBZ0UsQ0FBQztBQUV2RSxTQUFPLFFBQVEsT0FBTyxFQUFFLFFBQVEsQ0FBQyxDQUFDLEtBQUssS0FBSyxNQUFNO0FBQ2hELFVBQU0saUJBQWlCLElBQUksR0FBRztBQUM5QixVQUFNLG1CQUFtQixJQUFJLEdBQUc7QUFFaEMsbUJBQWUsS0FBSyxHQUFHLGNBQWMsTUFBTSxnQkFBZ0IsRUFBRTtBQUM3RCw2QkFBeUIsY0FBYyxJQUFJO0FBQzNDLDhCQUEwQixnQkFBZ0IsSUFBSTtBQUFBLEVBQ2hELENBQUM7QUFDRCxRQUFNLHNCQUFzQixPQUFPLGVBQWUsS0FBSyxJQUFJLENBQUM7QUFFNUQsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsZUFBZTtBQUFBLE1BQ2pCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxXQUFXLFNBQVM7QUFBQSxRQUNwQixlQUFlO0FBQUEsTUFDakIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLE1BQ2pCLGtCQUFrQixLQUFLLFNBQVMsWUFBWSx5QkFBeUI7QUFBQSxJQUN2RTtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUF1QztBQUM5RCxNQUFJLFFBQVEsT0FBTztBQUNqQixRQUFJLFFBQVEsTUFBTSxTQUFTO0FBQ3pCLFdBQUssYUFBYTtBQUNwQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFDQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-nonh2bhesfhjng6dssjepuobdu"
        name                      = "updateSection"
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.pipeline["deleteSection"] will be created
+   resource "aws_appsync_resolver" "pipeline" {
+       api_id            = "**************************"
+       arn               = (known after apply)
+       field             = "deleteSection"
+       id                = (known after apply)
+       kind              = "PIPELINE"
+       request_template  = jsonencode({})
+       response_template = "$util.toJson($ctx.result)"
+       type              = "Mutation"

+       pipeline_config {
+           functions = (known after apply)
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["deleteSection"] will be destroyed
  # (because key ["deleteSection"] is not in for_each map)
-   resource "aws_appsync_resolver" "resolver" {
-       api_id            = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
-       arn               = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/resolvers/deleteSection" -> null
-       code              = <<-EOT
            // mutation/deleteSection/deleteSection.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            
            // mutation/deleteSection/deleteSection.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity?.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              return {
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + input.sectionId
                }),
                operation: "DeleteItem",
                condition: {
                  expression: "#userId = :userId",
                  expressionNames: {
                    "#userId": "userId"
                  },
                  expressionValues: {
                    ":userId": { S: identity.sub }
                  }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return { ...context.result, deleted: true };
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZGVsZXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ00vQyxJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjs7O0FERnpCLFNBQVMsUUFDZCxTQUMyQjtBQUMzQixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLEtBQUs7QUFDbEIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUVoQyxTQUFPO0FBQUEsSUFDTCxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSSxtQkFBbUIsTUFBTSxNQUFNO0FBQUEsSUFDckMsQ0FBQztBQUFBLElBQ0QsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLE1BQ1QsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCO0FBQUEsUUFDaEIsV0FBVyxFQUFFLEdBQUcsU0FBUyxJQUFJO0FBQUEsTUFDL0I7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQXVDO0FBQzlELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUdBLFNBQU8sRUFBRSxHQUFHLFFBQVEsUUFBUSxTQUFTLEtBQUs7QUFDNUM7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT -> null
-       data_source       = "Wildsea_primary" -> null
-       field             = "deleteSection" -> null
-       id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-deleteSection" -> null
-       kind              = "UNIT" -> null
-       max_batch_size    = 0 -> null
-       type              = "Mutation" -> null
#        (2 unchanged attributes hidden)

-       runtime {
-           name            = "APPSYNC_JS" -> null
-           runtime_version = "1.0.0" -> null
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #393](https://github.com/jarrod-lowe/wildsea/actions/runs/11310284170)